import itertools # импортируем это модуль библиотеки python, я его добавляю, так как автоматическо оно у меня не подключено

A = {1, 2, 3, 4, 5, 6}
n = 3
m = 5
result = [set(combo) for combo in itertools.combinations(A, n)][:m] # здесь для каждой созданной комбинации преобразуется в множество (set), это делается для каждой комбинации
# также [:m] штука которая была уже ранее, то есть m это просто до какого элемента осавлять, в этом случае m=5 то есть оставляет только первые 5 комбинации
print(result)