
my_tuple = (55, 6, 777, 54, 6, 76, 7777, 1, 777, 6)
element_count = {} # мы создаем пустое хранилище и будем туда пихать элементы которые мы будем находить
for element in my_tuple: # используем цикл for чтобы он проверял элементы столько раз сколько количество элементов в выделенном tuple (my_tuple)
    element_count[element] = element_count.get(element, 0) + 1 # тут самое интересное, он используется для получения текущего значения  element из  element_count, то есть если элемент уже существует в словаре, его значение возвращается, в противном случае возвращается 0, а также +1 просто увеличивает значение element на 1
result_tuple = tuple((k, v) for k, v in element_count.items()) # начну с k и v,  k это уникальный ключ (уникальные элементы) в element_count, а v количество вхождений для каждого ключа, и потом делает подсчеты
print("Элементы и их вхождения:", result_tuple) # тут просто вывод